Тест/Тест/src/Documents/ЗаходАкция10/ЗаходАкция10.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаходАкция10</name>
  <registerRecords>AccumulationRegister.РегистрАкция10</registerRecords>
  <attributes>
    <name>НаименованиеАкции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАкции</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ИндКод</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаАкция</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Машина</name>
      <type>
        <types>CatalogRef.Машины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/AccumulationRegisters/РегистрАкция10/РегистрАкция10.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрАкция10</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/AccumulationRegisters/РегистрНакопления1/РегистрНакопления1.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РегистрНакопления1</name>
  <resources>
    <name>Колво</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>машина</name>
    <type>
      <types>CatalogRef.Машины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>индкод</name>
    <type>
      <types>CatalogRef.ИндКод</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Тест/Тест/src/Documents/ЗаходАкция10/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//======================================================================================================================

Движения.РегистрАкция10.Записывать = Истина;
Движения.Записать();
Движения.РегистрАкция10.Записывать = Истина;

Счетчик = 0; 
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаходАкция10Товары.Номенклатура,
	|	ЗаходАкция10Товары.Партия,
	|	ЗаходАкция10Товары.Количество,
	|	ЗаходАкция10Товары.ЦенаАкция,
	|	ЗаходАкция10Товары.Склад,
	|	ЗаходАкция10Товары.Машина
	|ПОМЕСТИТЬ ВТ_Заход
	|ИЗ
	|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
	|ГДЕ
	|	ЗаходАкция10Товары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|	ВТ_Заход.Номенклатура,
	|	ВТ_Заход.Партия,
	|	ВТ_Заход.Количество,
	|	ВТ_Заход.ЦенаАкция,
	|	ВТ_Заход.Склад,
	|	ВТ_Заход.Машина
	|ИЗ
	|	ВТ_Заход КАК ВТ_Заход
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки(&Период, индкод В
	|			(ВЫБРАТЬ
	|				Т.Партия
	|			ИЗ
	|				ВТ_Заход КАК Т)) КАК РегистрНакопления1Остатки
	|		ПО ВТ_Заход.Партия = РегистрНакопления1Остатки.индкод";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());

РезультатЗапроса = Запрос.Выполнить();
ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			 Дефицит = ВыборкаТовары.Количество - ВыборкаТовары.КолвоОстаток;
	       
			Если Дефицит>0 Тогда
	            Отказ = Истина;
	            Сообщение = Новый СообщениеПользователю;
	            Сообщение.Текст = "Номенклатура: "+ВыборкаТовары.Номенклатура + " Партия: " + ВыборкаТовары.Партия + " недостаточно в количестве "+Дефицит+" шт.";
	            Сообщение.Сообщить();
	        КонецЕсли;
	       
	        //  Переход в начало цикла, если были ошибки
	        Если Отказ Тогда
	            Продолжить;
	        КонецЕсли;
	       
	        //  Выполнение движений в регистры
	
				Движение			 = Движения.РегистрАкция10.ДобавитьПриход();
				Движение.Период		 = Дата;
				Движение.Товар		 = ВыборкаТовары.Номенклатура;
				Движение.индкод		 = ВыборкаТовары.Партия;
				Движение.Склад		 = ВыборкаТовары.Склад;
				Движение.машина		 = ВыборкаТовары.машина;
				Движение.Колво		 = ВыборкаТовары.Количество;
				Движение.Цена		 = ВыборкаТовары.ЦенаАкция; 
				
				Счетчик 			 = Счетчик + 1; 
	    КонецЦикла;

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Успех, в акции участвует: "+Счетчик+" ед. товаров."; 
	Сообщение.Сообщить();

//======================================================================================================================
КонецПроцедуры
